<template>
  <div class="terms">
    <h1>利用規約</h1>
    <p>
      この利用規約（以下，「本規約」とします。）は，本サービスの提供条件及びサービス運営者（以下「当方」と言います）とユーザーの皆様との間の権利義務関係が定められています。本サービスの利用に際しては、本規約の全文をお読みいただいたうえで、本規約に同意いただく必要があります。
    </p>

    <h2>第1条（適用）</h2>
    <p>
      本規約は、本サービスの提供条件及び本サービスの利用に関する当方とユーザーとの間の権利義務関係を定めることを目的とし、ユーザーと当方との間の本サービスの利用に関わる一切の関係に適用されます。
    </p>

    <h2>第2条（知的財産権等の帰属）</h2>
    <p>
      本サービス（本サイトを構成するテキスト・画像を含みます）の著作権、商標権及びその他すべての知的財産権は、当方に帰属します。法令により認められている場合を除き、ユーザーが、当方から適正な許諾を得ることなく、本サービスの全部又は一部を複製、翻案、出版、上映、レンタル、販売、頒布、展示、公衆送信（自動公衆送信可能化を含みます）その他の利用を行うことは、当方を侵害する行為として禁止されています。
    </p>

    <h2>第3条（禁止事項）</h2>
    <p>
      ユーザーは，本サービスの利用にあたり，以下の行為または該当すると当方が判断する行為をしてはなりません。
    </p>
    <ol>
      <li>法令に違反する行為または犯罪行為に関連する行為</li>
      <li>
        当方、本サービスの他の利用者またはその他の第三者に対する詐欺または脅迫行為
      </li>
      <li>
        当方、本サービスの他の利用者またはその他の第三者の知的財産権、肖像権、プライバシーの権利、名誉、その他の権利または利益を侵害する行為
      </li>
      <li>公序良俗に反する行為</li>
      <li>
        本サービスのサーバー又はネットワーク等の破壊や妨害、過度な負荷をかける行為
      </li>
      <li>
        本サービスに用いられるプログラムを改変し、毀損し、又は逆アセンブルし、逆コンパイルし、リバースエンジニアリングする行為
      </li>
      <li>
        本サービスを通じ、以下に該当し、または該当すると当方が判断する情報を当方または本サービスの他の利用者に送信すること
      </li>
      <ul>
        <li>
          過度に暴力的または残虐な表現を含む情報
        </li>
        <li>
          コンピューター・ウィルスその他の有害なコンピューター・プログラムを含む情報
        </li>
        <li>
          当方、本サービスの他の利用者またはその他の第三者の名誉または信用を毀損する表現を含む情報
        </li>
        <li>
          過度にわいせつな表現を含む情報
        </li>
        <li>
          差別を助長する表現を含む情報
        </li>
        <li>
          反社会的な表現を含む情報
        </li>
        <li>
          チェーンメール等の第三者への情報の拡散を求める情報
        </li>
        <li>
          他人に不快感を与える表現を含む情報
        </li>
      </ul>
      <li>本サービスによって得られた情報を商業的に利用する行為</li>
      <li>本サービスの運営を妨害するおそれのある行為</li>
      <li>本サービス、当方のサーバー又はネットワーク等への不正アクセス</li>
      <li>不正な目的を持って本サービスを利用する行為</li>
      <li>第三者に成りすます行為</li>
      <li>本サービスの他の利用者の情報の収集</li>
      <li>
        当方、本サービスの他の利用者またはその他の第三者に不利益、損害、不快感を与える行為
      </li>
      <li>
        本サービスが許諾しない本サービス上での宣伝，広告，勧誘，または営業行為，面識のない異性との出会いを目的とした行為
      </li>
      <li>
        本サービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為
      </li>
      <li>前各号の行為を直接または間接に惹起し、または容易にする行為</li>
      <li>前各号の行為を試みること</li>
      <li>その他，本サービス提供者が不適切と判断する行為</li>
    </ol>

    <h2>第4条（本サービスの提供の停止等）</h2>
    <p>
      本サービス提供者は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
    </p>
    <ol>
      <li>本サービスのシステムの保守点検または更新を行う場合</li>
      <li>
        本サービスが利用するインフラサービスの障害などにより，本サービスの提供が困難となった場合
      </li>
      <li>その他，本サービスの提供が困難と判断した場合</li>
    </ol>
    <p>
      本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。
    </p>

    <h2>第5条（免責事項）</h2>
    <p>
      本サービスの運営者は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。
    </p>

    <h2>第6条（サービス内容の変更、終了）</h2>
    <ol>
      <li>
        当方は、当方の都合により、本サービスの内容を変更し、または提供を終了することができます。
      </li>
      <li>
        当方が本サービスの提供を終了する場合、当方はユーザーに事前に通知するものとします。
      </li>
    </ol>

    <h2>第7条（利用規約の変更）</h2>
    <p>
      本サービス提供者は，必要と判断した場合には，ユーザーに通知することなくいつでも本規約を変更することができるものとします。なお，本規約の変更後，本サービスの利用を開始した場合には，ユーザーは変更後の規約に同意したものとみなします。
    </p>

    <h2>
      第8条（保証の否認及び免責）
    </h2>
    <p>
      当方は、本サービスに関してユーザーが被った損害について賠償する責任を負わないものとし、また、付随的損害、間接損害、特別損害、将来の損害及び逸失利益にかかる損害については、賠償する責任を負わないものとします。
      本サービスに関連してユーザーと他のユーザーまたは第三者との間において生じた取引、連絡、紛争等については、ユーザーが自己の責任によって解決するものとします。
    </p>

    <h2>
      第9条 分離可能性
    </h2>
    <p>
      本規約およびその他の利用条件等の規定の一部が法令に基づいて無効と判断されても、本規約およびその他の利用条件等のその他の規定は有効とします。
    </p>

    <h2>
      第10条 準拠法および管轄裁判所
    </h2>
    <ol>
      <li>
        本規約の準拠法は、日本法とします。
      </li>
      <li>
        本規約に関連する一切の紛争については、東京地方裁判所または東京簡易裁判所を第一審の専属的合意管轄裁判所とします。
      </li>
    </ol>
  </div>
</template>

<script>
export default {
  head() {
    return {
      title: '利用規約'
    }
  }
}
</script>

<style scoped>
h1 {
  margin-top: 20px;
  margin-bottom: 10px;
}
h2,
h3 {
  margin-top: 15px;
}
.v-application p {
  line-height: 1.7rem;
  margin-top: 0.3rem;
  margin-left: 10px;
  margin-bottom: 0.3rem;
}
ol {
  margin-left: 15px;
}
ol li {
  line-height: 1.7rem;
}
.terms {
  margin-bottom: 20px;
}
</style>
