<template>
  <v-dialog v-model="isDisplay" scrollable max-width="720px">
    <v-card>
      <v-card-title class="headline">
        宝具ダメージ計算方法と入力項目の詳細
        <v-spacer />
        <v-btn icon text @click="isDisplay = false">
          <v-icon>mdi-close</v-icon>
        </v-btn>
      </v-card-title>
      <v-divider />
      <v-card-text>
        <h3 class="mt-3 mb-1">
          使い方
        </h3>
        <p>
          ①クラスを選択するとサーヴァントが選択可能になります。<br />
          ②サーヴァントを選択すると攻撃力、宝具レベル、宝具倍率、そしてダメージ結果が自動入力されます。<br />
          ③お好みで入力値を変更するとダメージ結果も変更されます。<br />
          ④ダメージ結果や選択したサーヴァントによって邪ンヌのセリフが変わるのでお楽しみください。
        </p>
        <h3 class="mt-3 mb-1">計算方法</h3>
        <p>
          宝具ダメージ ＝ <br />
          攻撃力 × 宝具倍率 × 0.23 × (カード補正 × (カード性能アップ +
          敵カード耐性ダウン)) × <br />
          クラス相性補正 × 属性相性補正 × クラス補正 × (攻撃力アップ +
          敵防御力ダウン) × <br />
          (特攻バフ + 宝具威力アップ) × 宝具特攻 + 固定ダメージ <br />
        </p>
        <h3 class="mt-3 mb-1">
          計算項目の注意点
        </h3>
        <ul class="mb-3">
          <li>
            0.23 ・・・ FGOのダメージ計算で必ず入る補正値 <br />
            サーヴァントが攻撃した時にステータス通りのダメージが入らないのはこれが原因。
          </li>
          <li>
            カード補正 ・・・ 宝具タイプによって入る補正値 (バスター1.5
            アーツ1.0 クイック0.8)
          </li>
          <li>
            クラス相性補正 ・・・ クラス相性によって入る補正値 (等倍1.0 有利2.0
            不利0.5 狂・分(アルターエゴ)1.5)
          </li>
          <li>
            属性相性補正 ・・・ 属性相性によって入る補正値 (等倍1.0 有利1.1
            不利0.9)<br />
            FGOの裏設定でサーヴァントは1人につき1つ属性(天、地、人、星、獣)を持っている。(例
            アルトリアは地 ギルは天)<br />
            天は地に強く人に弱い。地は人に強く天に弱い。人は天に強く地に弱い。
            星、獣はお互いに強い。
            FGOで思ったよりダメージが伸びない時はこれが原因。
          </li>
          <li>
            クラス補正 ・・・ クラスによってはいる補正値
            (剣、騎、月、分、降、盾は1.0 弓は0.95<br />
            槍は1.05 術、殺0.9 狂、裁定、復讐は1.1)
          </li>
        </ul>
        <h3 class="mt-3 mb-1">
          入力項目の詳細
        </h3>
        <ul class="mb-3">
          <li>
            攻撃力アップ ・・・ 攻撃力アップスキル (例 アルトリアの第一スキル)
          </li>
          <li>
            防御力ダウン ・・・ 敵の防御力ダウンスキル (例
            スカサハ＝スカディの第二スキル)
          </li>
          <li>
            カード性能アップ ・・・ カード性能アップスキル (バスターUP アーツUP
            クイックUP)
          </li>
          <li>
            敵カード性能ダウン ・・・ 敵カード耐性ダウンスキル (例
            アルジュナオルタの宝具)
          </li>
          <li>
            特攻バフ ・・・ 特攻付与スキル (例
            スカサハの〔神性〕特攻を付与スキル)
          </li>
          <li>
            宝具威力アップ ・・・ 宝具威力アップスキル (例
            スペースイシュタルの第2スキル)
          </li>
          <li>
            特攻宝具 ・・・ 宝具時に乗る特攻倍率 (例 ギルのサーヴァント特攻)
          </li>
          <li>
            固定ダメージ ・・・ 毒、やけど、呪いのダメージ
          </li>
        </ul>
      </v-card-text>
    </v-card>
  </v-dialog>
</template>

<script>
export default {
  data() {
    return {
      isDisplay: false
    }
  }
}
</script>
